#include <iostream>

using namespace std;

int CourseProject(unsigned short &number_of_task) {
    while(true) {
        cout << "\nВыберите номер задания, к которому хотите получить доступ:\n"
                "1. Создание бинарного дерева с рандомными элементами\n"
                "2. Создание бинарного дерева с определёнными элементами\n"
                "3. Создание бинарного дерева с числами из файла\n"
                "4. Вывод дерева в консоль\n"
                "5. Вывод дерева в файл\n"
                "6. Вставка элемента и время вставки\n"
                "7. Удаление элемента и время удаления\n"
                "8. Получение элемента и время получения\n"
                "9. Прямой обход\n"
                "10. Обратный обход\n"
                "11. Обход в ширину\n"
                "12. Генерация и выполнение файловых заданий\n"
                "Для возвращения в предыдущее меню введите 0\n\n"
                "Номер: ";
        cin >> number_of_task;
        switch (number_of_task) {
            case 0: {
                cout << "\nВозвращение в предыдущее меню...\n";
                return 0;
            }
            default: {
                cout << "\nЗадания с таким номером не существует\n";
                break;
            }
        }
    }
}
