#include <iostream>

using namespace std;

int PractRab3(unsigned short number_of_task) {
    while (true) {
        cout << "\nВыберите номер задания, к которому хотите получить доступ:\n"
                "1. Перевод из обычной записи в польскую запись\n"
                "2. Перевод из обычной записи в обратную польскую запись\n"
                "3. Вычисление по обычной записи\n"
                "4. Вычисление по польской нотации\n"
                "5. Вычисление по обратной польской нотации\n"
                "Для возвращения в предыдущее меню введите 0\n\n"
                "Номер: ";
        cin >> number_of_task;

        switch (number_of_task) {
            case 0: {
                cout << "\nВозвращение в предыдущее меню...\n";
                return 0;
            }
            case 1: { // Создание списка с заданной размерностью и рандомными значениями (Задание 1,а)
                break;
            }
            case 2: { // Создание списка с размерностью по количеству введённых элементов (Задание 1,б)
                break;
            }
            case 3: { // Вставка элемента (Задание 3.1)
                break;
            }
            case 4: { // Удаление элемента по значению (Задание 3.2)
                break;
            }
            case 5: { // Удаление элемента по позиции (Задание 3.3)
                break;
            }
            default: {
                cout << "\nЗадания с таким номером не существует\n";
                break;
            }
        }
    }
}

